In [15]:
import pandas as pd

In [16]:

data = {'Name':['A','B','C','D','E'],
        'Age': [12,14,13,15,16],
        'Class': ['IOT','CCML','AI','IOT','AI'],
        'Roll': [23,12,45,60,3]}
df=pd.DataFrame(data)

In [17]:

df['Name']

0    A
1    B
2    C
3    D
4    E
Name: Name, dtype: object

In [18]:
print(df.head()) #top 5
print(df.head(2))

  Name  Age Class  Roll
0    A   12   IOT    23
1    B   14  CCML    12
2    C   13    AI    45
3    D   15   IOT    60
4    E   16    AI     3
  Name  Age Class  Roll
0    A   12   IOT    23
1    B   14  CCML    12

In [19]:
df.tail(1)

  Name  Age Class  Roll
4    E   16    AI     3

In [20]:
df.shape

(5, 4)

In [21]:
df.describe()

             Age       Roll
count   5.000000   5.000000
mean   14.000000  28.600000
std     1.581139  23.543577
min    12.000000   3.000000
25%    13.000000  12.000000
50%    14.000000  23.000000
75%    15.000000  45.000000
max    16.000000  60.000000

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Class   5 non-null      object
 3   Roll    5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [23]:
print(df.Class.unique())
print(df.Class.nunique())

['IOT' 'CCML' 'AI']
3